[
    {
        "headline": "Australian war crimes whistleblower pleads guilty",
        "content": "After failed attempts to convince Attorney General Mark Dreyfus to intervene and drop the prosecution - as Mr Dreyfus did in the case of fellow whistleblower Bernard Collaery last year - McBride then tried to argue that he had a duty to leak the documents, because doing so was in the public interest."
    },
    {
        "headline": "Beijing touts 'historic' Xi-Biden meeting",
        "content": "There were some wins. The two sides agreed to resume military communications and work together to combat the flow of fentanyl into the US. But the sticking points remained too - from the so-called chip wars to thornier issues such as Taiwan. Towards the end of a solo press conference, Mr Biden repeated his view that Mr Xi is a dictator, while answering a question."
    },
    {
        "headline": "Australian students use 'sick note' for protest",
        "content": "The Minister for Education Jason Clare also said students should not be at the Friday strike. \"I want our kids to be passionate, I want our kids to care about democracy and I want our kids to care about the future, but I also want our kids at school,\" he said."
    },
    {
        "headline": "The Indian artist who painted for British rulers",
        "content": "Look at the painting again. You can see the outer gate of the complex, and the Imambara itself is out of view. To reach the imposing building, visitors have to pass through this gate and two large courtyards before reaching the central hall, which is one of the world's largest arched constructions without the support of beams or pillars."
    },
    {
        "headline": "Gaza hospital boss says no water or oxygen left",
        "content": "Asked by the BBC why progress on talks to release hostages had failed, he said that on three occasions they had been close to a deal but each time it had been stopped by Israeli Prime Minister Benjamin Netanyahu."
    },
    {
        "headline": "Ukrainian men flee the draft in their thousands",
        "content": "While we do not know how those men escaped, we do know what methods were used by the other 21,113 who were caught trying. The majority - 14,313 - were attempting to walk or swim across the border, and the remaining 6,800 relied on fraudulently obtained official paperwork stating fake exemptions such as fabricated illnesses, the Ukrainian authorities said."
    },
    {
        "headline": "Singer Cassie accuses Diddy of rape and abuse",
        "content": "\"Mr Combs told Ms Ventura that he was going to blow up Kid Cudi's car,\" the complaint says, \"and that he wanted to ensure that Kid Cudi was home with his friends when it happened. Around that time, Kid Cudi's car exploded in his driveway.\""
    },
    {
        "headline": "Berlin on edge for Erdogan after fierce Israel criticism",
        "content": "But Germany and Turkey need each other. Germany is an important trade partner for Turkey. It also is home to the world's largest Turkish diaspora community and is an electoral battleground for President Erdogan. He is popular with some German-Turks."
    },
    {
        "headline": "Australia beat South Africa in thriller to reach final",
        "content": "ICC Men's World Cup, Kolkata South Africa 212 (49.4 overs): Miller 101 (116), Klaasen 47 (48); Starc 3-34 Australia 215-7 (47.2 overs): Head 62 (48); Shamsi 2-42 Australia won by three wickets Scorecard\n\nAustralia are through to the World Cup final after a tension-filled three-wicket win over South Africa in Kolkata.\n\nAfter bowling South Africa out for 212, Pat Cummins' side made a flying start with Travis Head hitting a quickfire 62 before they were pegged back by the Proteas spinners and slipped to 137-5.\n\nAustralia edged closer but lost their seventh wicket with 20 runs still needed and although the pressure continued to build, Cummins and Mitchell Starc kept their cool to complete a hard-fought victory with 16 balls to spare.\n\nThe Proteas had been reduced to 24-4 following superb new-ball bursts from Josh Hazlewood and Starc before David Miller rescued the innings with a determined 101 from 116 balls.\n\nBut despite a valiant effort in the field, it wasn't enough and Australia advance to face India in Sunday's final in Ahmedabad.\n\nBatting first in overcast conditions was a risk South Africa were willing to take given their previous success with that approach but they were soon in trouble as Starc and Hazlewood tore through the top order.\n\nStarc removed Temba Bavuma in the first over, Quinton de Kock fell to Hazlewood in the sixth and with Australia energised in the field, South Africa had just eight on the board after seven overs and were 18-2 at the end of the powerplay.\n\nWhen Aiden Markram and Rassie van der Dussen fell in successive overs, it was left to Miller and Heinrich Klaasen to salvage the innings and, either side of a 40-minute rain delay, the pair did just that with a composed 95-run stand.\n\nKlaasen fell for 47 but Miller kept going, reaching his sixth one-day international hundred with his fifth sixth before holing out from the next legal delivery.\n\nHead and David Warner looked like knocking the runs off in a hurry, adding 60 in the first six overs, and even when the latter was bowled by Markram, the runs kept coming for Australia.\n\nSouth Africa's seamers were taking some punishment and Head, dropped on 40, hit three consecutive boundaries to bring up his half-century.\n\nThe introduction of spin changed the game. Keshav Maharaj bowled Head through the gate for 62 and Tabraiz Shamsi accounted for Marnus Labuschagne and Glenn Maxwell to bring the Proteas right back into contention.\n\nJosh Inglis and Steve Smith prevented a collapse but with the finish line in sight for Australia, Coetzee bounced out Smith and then bowled Inglis.\n\nWith South Africa refusing to know when they were beaten, Starc and Cummins had to bide their time and more than seven overs went by before the Australia skipper cut Marco Jansen for four to seal the win.\n\nSouth Africa fail to recover from early collapse\n\nEven under gloomy skies and with captain Bavuma admitting he was not fully fit, it was no surprise South Africa chose to bat first.\n\nThey have been every bit as dominant setting a total as they have been jittery chasing at this World Cup.\n\nInside the first 12, though, they saw their hitherto hugely effective plan picked apart by Starc and Hazlewood.\n\nThe bowling and fielding was of the highest quality and South Africa's top order simply could not withstand the pressure.\n\nBut, for a side infamous for crumbling in high-pressure games in years gone by, they showed impressive fight with both bat and ball.\n\nMiller and Klaasen stood tall in the face of some intense Australia pressure to ensure South Africa at least had a total to defend.\n\nThey could then have wilted with the ball after a horrendous start but instead their resilience shone through with their grit and determination on full display in the form of Coetzee, who powered through an eight-over spell to take the game deep.\n\nUltimately, though, their early collapse cost them. Another 30 runs may have been enough. But, as it is, for all the spirit they showed, the wait to reach a men's World Cup final goes on.\n\nAustralia hold firm to give themselves a shot at glory\n\nSix weeks have gone by but Australia's World Cup will end as it began, going head-to-head with a formidable India side.\n\nThe venue has changed but the challenge facing them remains the same as they take on a team with no obvious weaknesses in their home conditions, in front of a packed-house, 99.9% of whom will be supporting India.\n\nBut while the challenge is the same, Australia themselves are not. They have grown into this tournament since the six-wicket defeat in Chennai and after eight wins on the bounce, confidence will be high.\n\nThis is what Australia do at World Cups. They win.\n\nAs hard as they made it for themselves against South Africa, they got the job done. The talent at their disposal was clear at the start of both innings and their experience came through at the death.\n\nAustralia have avenged one of their two losses at this tournament in the semis and, even up against the might of India, they will be backing themselves to make up for the other in the final.\n\n'Australia were ruthless' - what they said\n\nAustralia captain Pat Cummins: \"I think it is easier out there than sitting in the dug-out. A nerve-wracking couple of hours. Great effort, plenty of good performances. We're pretty pumped.\n\n\"It's going to be a special final. I still talk of the 2015 final as one of my career highlights and I wasn't even playing. So to be out there in a final, in India, world's biggest stadium... it's a very happy changing room at the moment.\"\n\nSouth Africa captain Temba Bavuma: \"Our character came through. We showed the resilience we talk about and a bit of dog fight. The way we started with the bat and ball was the turning point, we always had to play catch-up.\n\n\"The conditions combined with the quality of the Australia attack. They were ruthless and exploited every bit of advantage, and really put us under pressure. From 24-4, it was always going to be hard to get a competitive total.\"\n\nPlayer of the match, Australia's Travis Head: \"It's hard to unpack all of that. I didn't move for the past couple of hours. It was a tense finish and an amazing game.\n\n\"We knew how it was going to play and how we would adapt. You train, go to bed and think about it.\n\n\"We knew it would be a grind and a battle and that's what it was.\""
    },
    {
        "headline": "Berlin on edge for Erdogan after fierce Israel criticism",
        "content": "But Germany and Turkey need each other. Germany is an important trade partner for Turkey. It also is home to the world's largest Turkish diaspora community and is an electoral battleground for President Erdogan. He is popular with some German-Turks."
    },
    {
        "headline": "Australia beat South Africa in thriller to reach final",
        "content": "ICC Men's World Cup, Kolkata South Africa 212 (49.4 overs): Miller 101 (116), Klaasen 47 (48); Starc 3-34 Australia 215-7 (47.2 overs): Head 62 (48); Shamsi 2-42 Australia won by three wickets Scorecard\n\nAustralia are through to the World Cup final after a tension-filled three-wicket win over South Africa in Kolkata.\n\nAfter bowling South Africa out for 212, Pat Cummins' side made a flying start with Travis Head hitting a quickfire 62 before they were pegged back by the Proteas spinners and slipped to 137-5.\n\nAustralia edged closer but lost their seventh wicket with 20 runs still needed and although the pressure continued to build, Cummins and Mitchell Starc kept their cool to complete a hard-fought victory with 16 balls to spare.\n\nThe Proteas had been reduced to 24-4 following superb new-ball bursts from Josh Hazlewood and Starc before David Miller rescued the innings with a determined 101 from 116 balls.\n\nBut despite a valiant effort in the field, it wasn't enough and Australia advance to face India in Sunday's final in Ahmedabad.\n\nBatting first in overcast conditions was a risk South Africa were willing to take given their previous success with that approach but they were soon in trouble as Starc and Hazlewood tore through the top order.\n\nStarc removed Temba Bavuma in the first over, Quinton de Kock fell to Hazlewood in the sixth and with Australia energised in the field, South Africa had just eight on the board after seven overs and were 18-2 at the end of the powerplay.\n\nWhen Aiden Markram and Rassie van der Dussen fell in successive overs, it was left to Miller and Heinrich Klaasen to salvage the innings and, either side of a 40-minute rain delay, the pair did just that with a composed 95-run stand.\n\nKlaasen fell for 47 but Miller kept going, reaching his sixth one-day international hundred with his fifth sixth before holing out from the next legal delivery.\n\nHead and David Warner looked like knocking the runs off in a hurry, adding 60 in the first six overs, and even when the latter was bowled by Markram, the runs kept coming for Australia.\n\nSouth Africa's seamers were taking some punishment and Head, dropped on 40, hit three consecutive boundaries to bring up his half-century.\n\nThe introduction of spin changed the game. Keshav Maharaj bowled Head through the gate for 62 and Tabraiz Shamsi accounted for Marnus Labuschagne and Glenn Maxwell to bring the Proteas right back into contention.\n\nJosh Inglis and Steve Smith prevented a collapse but with the finish line in sight for Australia, Coetzee bounced out Smith and then bowled Inglis.\n\nWith South Africa refusing to know when they were beaten, Starc and Cummins had to bide their time and more than seven overs went by before the Australia skipper cut Marco Jansen for four to seal the win.\n\nSouth Africa fail to recover from early collapse\n\nEven under gloomy skies and with captain Bavuma admitting he was not fully fit, it was no surprise South Africa chose to bat first.\n\nThey have been every bit as dominant setting a total as they have been jittery chasing at this World Cup.\n\nInside the first 12, though, they saw their hitherto hugely effective plan picked apart by Starc and Hazlewood.\n\nThe bowling and fielding was of the highest quality and South Africa's top order simply could not withstand the pressure.\n\nBut, for a side infamous for crumbling in high-pressure games in years gone by, they showed impressive fight with both bat and ball.\n\nMiller and Klaasen stood tall in the face of some intense Australia pressure to ensure South Africa at least had a total to defend.\n\nThey could then have wilted with the ball after a horrendous start but instead their resilience shone through with their grit and determination on full display in the form of Coetzee, who powered through an eight-over spell to take the game deep.\n\nUltimately, though, their early collapse cost them. Another 30 runs may have been enough. But, as it is, for all the spirit they showed, the wait to reach a men's World Cup final goes on.\n\nAustralia hold firm to give themselves a shot at glory\n\nSix weeks have gone by but Australia's World Cup will end as it began, going head-to-head with a formidable India side.\n\nThe venue has changed but the challenge facing them remains the same as they take on a team with no obvious weaknesses in their home conditions, in front of a packed-house, 99.9% of whom will be supporting India.\n\nBut while the challenge is the same, Australia themselves are not. They have grown into this tournament since the six-wicket defeat in Chennai and after eight wins on the bounce, confidence will be high.\n\nThis is what Australia do at World Cups. They win.\n\nAs hard as they made it for themselves against South Africa, they got the job done. The talent at their disposal was clear at the start of both innings and their experience came through at the death.\n\nAustralia have avenged one of their two losses at this tournament in the semis and, even up against the might of India, they will be backing themselves to make up for the other in the final.\n\n'Australia were ruthless' - what they said\n\nAustralia captain Pat Cummins: \"I think it is easier out there than sitting in the dug-out. A nerve-wracking couple of hours. Great effort, plenty of good performances. We're pretty pumped.\n\n\"It's going to be a special final. I still talk of the 2015 final as one of my career highlights and I wasn't even playing. So to be out there in a final, in India, world's biggest stadium... it's a very happy changing room at the moment.\"\n\nSouth Africa captain Temba Bavuma: \"Our character came through. We showed the resilience we talk about and a bit of dog fight. The way we started with the bat and ball was the turning point, we always had to play catch-up.\n\n\"The conditions combined with the quality of the Australia attack. They were ruthless and exploited every bit of advantage, and really put us under pressure. From 24-4, it was always going to be hard to get a competitive total.\"\n\nPlayer of the match, Australia's Travis Head: \"It's hard to unpack all of that. I didn't move for the past couple of hours. It was a tense finish and an amazing game.\n\n\"We knew how it was going to play and how we would adapt. You train, go to bed and think about it.\n\n\"We knew it would be a grind and a battle and that's what it was.\""
    },
    {
        "headline": "US and China agree to resume military communications",
        "content": "The two leaders also discussed the conflict in Israel and Gaza. One senior US official told reporters that Mr Biden had asked China to use its influence with Iran to urge it not to take steps that could be seen as provocative."
    },
    {
        "headline": "The last chance to save a mighty river",
        "content": "Error parsing the article: Article `download()` failed with HTTPSConnectionPool(host='www.bbc.comhttps', port=443): Max retries exceeded with url: //www.bbc.co.uk/news/extra/3s2qsuikpf/mekong-the-last-chance-to-save-a-mighty-river (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x0000029798128F50>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')) on URL https://www.bbc.comhttps://www.bbc.co.uk/news/extra/3s2qsuikpf/mekong-the-last-chance-to-save-a-mighty-river"
    },
    {
        "headline": "IBM pulls X ads as content seen beside pro-Nazi posts",
        "content": "Media Matters said Mr Musk's tweet, which was seen by more than five million people, according to the site's statistics, amounted to an endorsement of an antisemitic conspiracy theory known as \"white genocide\". It argues that Jewish people systematically plot to encourage immigration of \"non-white\" people to Western countries in order to create demographic change and \"eliminate\" the white race."
    },
    {
        "headline": "Lack of fuel causes blackout across Gaza",
        "content": "Allow Twitter content?\n\nThis article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’."
    },
    {
        "headline": "Israel says body of 65-year-old hostage found in Gaza",
        "content": "She had been recovering from breast cancer when Hamas launched its deadly attack on 7 October, but was without her medication when she was taken, according to the Bring Them Home Now group."
    },
    {
        "headline": "BBC goes inside Al-Shifa hospital with the Israeli army",
        "content": "\"At the end of the day, this is just the tip of the iceberg,\" he said. \"Hamas aren't here because they saw we were coming. This is probably what they were forced to leave behind. Our assessment is that there's much more.\""
    },
    {
        "headline": "How the dead are counted in Gaza",
        "content": "Health ministry officials say the death figures are recorded by medical professionals before being passed on to them and the figures only include people recorded dead in hospital. The figures do not distinguish between military and civilian deaths. And, because they do not take into account those who died at the scene of blasts whose bodies have not been found, or buried immediately, they may be an undercount, Gazan officials say."
    },
    {
        "headline": "Bowen: Hospital raid comes as tone shifts on Israel",
        "content": "At the same time, we have seen a hardening of the international position around the Israeli offensive in the last few days with the US, the UK and France using language that is shifting the tone - perhaps summed up best by what US Secretary of State Antony Blinken said last weekend: \"Far too many\" Palestinian civilians have been killed."
    },
    {
        "headline": "Weekly quiz: Who was given the cold shoulder by the Grammys?",
        "content": "It's the weekly news quiz - how closely have you been paying attention to what's been going on in the world over the past seven days?"
    },
    {
        "headline": "Angélique Kidjo's secret to success: Being hangry",
        "content": "\"In the middle of the communist dictatorship in my country it was too much for me to stomach, and I wrote a very violent song. My father said, 'I understand how you feel but we aren't going to write about hate in this home. We never brought you up to think that hating and violence is a good thing.'"
    },
    {
        "headline": "Africa's top shots: Pirates and paper doves",
        "content": "Image caption,\n\nWhile fans in other stands show their support for Kaizer Chiefs - who go on to lose the game."
    },
    {
        "headline": "'Denied medicine until they take a Russian passport'",
        "content": "\"When you go to a hospital you need to have a Russian passport. If you do not have a Russian passport, they won't treat you. If you drive your own car and the patrol stops you, and you do not have a Russian passport, they can simply take your car away. So people are forced to obtain them. Retired people are forced to obtain Russian passports to receive pensions. It is a matter of survival.\""
    },
    {
        "headline": "Indian fashion designers face eco-chic dilemma",
        "content": "While sustainability is often seen as only related to the environment, in the Indian context, it should also include improving the working conditions of artisans who form the backbone of the fashion market. Some of the biggest names on the runways of Paris and Milan quietly rely on these highly-skilled workers to produce their fabulous hand-made outfits and India is one of the largest exporters of garments and textiles at $44.4bn."
    },
    {
        "headline": "Is Mean Girls too noughties to function in 2024?",
        "content": "Being thin, disengaged with academia and having a hot boyfriend are portrayed as the best ways to be liked (or feared) both in the 2004 film and the later musical. But more recent high school stories have started to look at the age-old concept of teenage cliques from fresh angles."
    },
    {
        "headline": "Ethiopian artist breaks African art-world record again",
        "content": "Mehretu painted Walkers With the Dawn and Morningit as part of an exhibition created in response to Hurricane Katrina in 2005 and its impact on the US city of New Orleans."
    },
    {
        "headline": "Harry Styles buzz cut reveal lights up fan debate",
        "content": "Allow Instagram content?\n\nThis article contains content provided by Instagram. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Meta’s Instagram cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’."
    },
    {
        "headline": "VideoIceland helicopter video shows giant cracks in earth",
        "content": "BBC correspondent Jessica Parker has flown on a mission with the Icelandic Coast Guard over the Reykjanes Peninsula, where recent volcanic activity has been concentrated.\n\nScientists say the area could face decades of increased volcanic instability.\n\nFears of an impending eruption led to the evacuation of the town of Grindavik, which has partially sunk by more than a metre.\n\nIt is thought that magma is running underneath a previous, centuries-old, visible fissure seen in aerial photographs.\n\nIceland's biggest bulldozer is heading to the small fishing town to build defences to stop lava from a volcano destroying key buildings.\n\nOne of the country's most famous tourist attractions, the nearby Blue Lagoon, will remain closed until the end of this month.\n\nRead more on this story here"
    },
    {
        "headline": "The Crown final season savaged by critics",
        "content": "Singh also criticised the handling of the the car crash scene, writing: \"The chaos of Diana and Dodi's final day in Paris is conveyed but there are no scenes inside the Pont d'Alma tunnel: we cut from the sound of the crash to the phone ringing at Balmoral. All dialogue in which someone breaks the news of Diana's death has been dubbed out; their mouths move in silence, and we focus on the reactions."
    },
    {
        "headline": "Couple killed themselves rather than be apart",
        "content": "She said it was the \"joint intention\" of each of them to end their lives and ended the hearing by saying it was clear the couple were \"incredibly grateful\" for the \"love and support\" of their family."
    },
    {
        "headline": "WeWork fell – will coworking go, too?",
        "content": "Error parsing the article: Article `download()` failed with HTTPSConnectionPool(host='www.bbc.comhttps', port=443): Max retries exceeded with url: //www.bbc.com/worklife/article/20231115-after-weworks-bankruptcy-what-is-the-future-of-coworking (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x000002979812B510>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')) on URL https://www.bbc.comhttps://www.bbc.com/worklife/article/20231115-after-weworks-bankruptcy-what-is-the-future-of-coworking"
    },
    {
        "headline": "The eight best photo-ops in NYC",
        "content": "Error parsing the article: Article `download()` failed with HTTPSConnectionPool(host='www.bbc.comhttps', port=443): Max retries exceeded with url: //www.bbc.com/travel/article/20231115-discover-the-eight-best-photo-ops-in-new-york-city (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x000002979812AB10>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')) on URL https://www.bbc.comhttps://www.bbc.com/travel/article/20231115-discover-the-eight-best-photo-ops-in-new-york-city"
    },
    {
        "headline": "The scandalous queens of 1910s New York",
        "content": "Error parsing the article: Article `download()` failed with HTTPSConnectionPool(host='www.bbc.comhttps', port=443): Max retries exceeded with url: //www.bbc.com/culture/article/20231114-radicals-and-rogues-these-subversive-1910s-women-made-new-york-cool-but-were-written-out-of-history (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x000002979812AB10>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')) on URL https://www.bbc.comhttps://www.bbc.com/culture/article/20231114-radicals-and-rogues-these-subversive-1910s-women-made-new-york-cool-but-were-written-out-of-history"
    },
    {
        "headline": "How I reduced my pets' carbon paw print",
        "content": "Error parsing the article: Article `download()` failed with HTTPSConnectionPool(host='www.bbc.comhttps', port=443): Max retries exceeded with url: //www.bbc.com/future/article/20231115-how-i-made-my-pets-more-environmentally-friendly (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x000002979812B510>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')) on URL https://www.bbc.comhttps://www.bbc.com/future/article/20231115-how-i-made-my-pets-more-environmentally-friendly"
    },
    {
        "headline": "Wendell Pierce on black resilience",
        "content": "Error parsing the article: Article `download()` failed with HTTPSConnectionPool(host='www.bbc.comhttps', port=443): Max retries exceeded with url: //www.bbc.com/worklife/article/20231114-wendell-pierce-interview-influential-katty-kay (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x000002979812B290>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')) on URL https://www.bbc.comhttps://www.bbc.com/worklife/article/20231114-wendell-pierce-interview-influential-katty-kay"
    },
    {
        "headline": "An autumnal feast to remember",
        "content": "Error parsing the article: Article `download()` failed with HTTPSConnectionPool(host='www.bbc.comhttps', port=443): Max retries exceeded with url: //www.bbc.com/travel/article/20231114-three-native-american-dishes-to-celebrate-fall (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x000002979812AB10>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')) on URL https://www.bbc.comhttps://www.bbc.com/travel/article/20231114-three-native-american-dishes-to-celebrate-fall"
    }
]